Revit 2027 API
SpecTypeId.LineSpringCoefficient Property
 Line Spring Coefficient, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LineSpringCoefficient { get; }
Public Shared ReadOnly Property LineSpringCoefficient As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LineSpringCoefficient {
	ForgeTypeId^ get ();
}
static member LineSpringCoefficient : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace